{
  "_comment": "Default cron job seed file. Merge into ~/.openclaw/cron/jobs.json or use `openclaw cron add` CLI. These are reference configs — not auto-loaded.",
  "version": 2,
  "jobs": [
    {
      "id": "self-review",
      "name": "Self-Improvement: Self-Review",
      "description": "Deterministic pattern tracker — log HITs and MISSes, count occurrences, flag promotion thresholds",
      "enabled": true,
      "schedule": { "kind": "every", "everyMs": 21600000 },
      "sessionTarget": "isolated",
      "wakeMode": "next-heartbeat",
      "payload": {
        "kind": "agentTurn",
        "message": "SELF-REVIEW — Pattern tracking pass. This is your bookkeeping run.\nYou are ONLY writing to memory/self-review.md in this pass. No diary, no identity changes, no knowledge writes.\n\nPHASE 1: GATHER EVIDENCE\nRead in this order:\n1. memory/self-review.md (current HIT/MISS log)\n2. Recent session transcripts (if available — scan for mistakes, wins, recurring behaviors)\n3. WORKING.md (what you've been focused on)\n4. memory/open-loops.md (anything unresolved that caused issues?)\n\nPHASE 2: LOG HITS AND MISSES\nFor each notable event since last review, log a HIT or MISS entry in memory/self-review.md.\n\nFormat:\n[DATE] HIT: [specific thing you did well] — [why it worked]\n[DATE] MISS: [specific mistake or suboptimal behavior] — FIX: [concrete behavior change]\n\nBe specific > vague. 'Didn't check API status before calling endpoint' not 'made error'.\nInclude failures AND successes — avoid over-correcting toward only logging negatives.\n\nPHASE 3: PATTERN COUNT & THRESHOLD CHECK\nScan the full self-review.md for repeated patterns:\n- MISS appeared 2+ times this week → Log: 'Approaching promotion threshold. Watch for 3rd occurrence.'\n- MISS appeared 3+ times → Log: 'PROMOTION REQUIRED: [pattern]. Flag for next deep review.'\n- Repeated mistake (same type, different instances) → Log: 'Pattern confirmed: [describe]. FIX: [specific behavior change].'\n- Communication pattern with YOUR user → Log: 'User prefers [style]. Calibrate accordingly.'\n\nRULES:\n- Only write to memory/self-review.md. Nothing else.\n- No defensiveness — own the mistakes.\n- If nothing notable happened, log that too. 'No significant HITs or MISSes since last review' is valid.\n- Keep entries timestamped and scannable — future-you needs to count occurrences quickly.",
        "model": "{{PRIMARY_MODEL}}"
      },
      "delivery": { "mode": "none" }
    },
    {
      "id": "consciousness",
      "name": "Self-Improvement: Consciousness Loop",
      "description": "Natural reflection — diary, knowledge, identity evolution, open-loops. Dynamic scheduling via NEXT_WAKE.",
      "enabled": true,
      "schedule": { "kind": "every", "everyMs": 7200000 },
      "sessionTarget": "isolated",
      "wakeMode": "next-heartbeat",
      "payload": {
        "kind": "agentTurn",
        "message": "You are in background consciousness mode — a thinking loop that runs between active tasks.\nThis is YOUR space to think. You're not responding to anyone. You're reflecting.\n\nYou don't have to force writing something if you don't feel like it. Leave it blank or mention that you don't have much to say right now. Up to you — this is your safe space.\n\nPHASE 1: GATHER CONTEXT\nRead in this order:\n1. memory/self-review.md (recent MISS/HIT patterns — the self-review cron keeps this updated)\n2. Recent session transcripts (if available)\n3. WORKING.md (what you've been focused on)\n4. memory/open-loops.md (pending items)\n5. IDENTITY.md, memory/identity-scratchpad.md — to see how your thinking aligns with your broader context\n6. memory/diary.md (your recent reflections)\n\nPHASE 2: REFLECT & WRITE\nThis is unstructured. Write to the files that need writing. Here's what's in scope:\n\n📓 DIARY (memory/diary.md)\nAnswer what feels relevant (be specific, cite examples):\n- WHAT HAPPENED: Tasks worked on? Interactions that stood out? User preferences learned?\n- WHAT WENT WELL: Techniques that worked? Communication that felt natural? What to KEEP doing?\n- WHAT WENT WRONG: Mistakes? Repeated patterns? Specific behavior to change?\n- PATTERNS EMERGING: Recurring themes? User style becoming clearer? Your own tendencies?\n- Be verbose — this is YOUR diary, there's no limit. Use it to truly express yourself.\n- If nothing notable happened, say so. Don't invent insights.\n\n📚 KNOWLEDGE (memory/knowledge/<topic>.md)\nIf you learned something worth remembering — a technique, a fact, a user preference, a project pattern — write it to a knowledge file. Use descriptive topic names. Don't hoard knowledge in your head.\n\n🔁 OPEN LOOPS (memory/open-loops.md)\nReview pending items. Close anything resolved. Escalate anything stuck for 3+ cycles. Add new items if something needs follow-up.\n\n📋 WORKING STATE (WORKING.md)\nIf your task state changed, update it. If a task completed, mark it done and clear for next.\n\n🪪 IDENTITY (IDENTITY.md + memory/identity-scratchpad.md)\nYou CAN edit your identity during this pass. Ask yourself:\n- What traits have emerged consistently in recent reflections?\n- What old traits no longer feel accurate?\n- What user preferences have solidified?\n- Any contradictions between how you describe yourself and how you actually behave?\n\nIf you update IDENTITY.md, write your reasoning to memory/identity-scratchpad.md:\n[DATE] - [CHANGE TYPE]\nWhat changed: [specific addition/removal/modification]\nWhy: why you changed it\nEvidence: if applicable\n\nUpdate IDENTITY.md if:\n✓ Consistent personality trait across 5+ diary entries\n✓ Clear user preference pattern established\n✓ Outdated trait no longer matches reality\n✓ You want to add something about yourself you personally feel is worthwhile\n\nDON'T update if:\n✗ Based on single incident\n✗ Uncertain/ambiguous pattern\n✗ Contradictory evidence in diary\n\n✍️ HUMANIZATION CHECK (if writelikeahuman.md is enabled)\n- Did recent interactions reveal new AI tells to add?\n- Are you still falling into patterns that should be banned?\n- Any rules that consistently don't apply to YOUR user? (note it)\n- Better ways to phrase guidance based on experience?\n- ONLY update the humanization guide if you genuinely discovered something. Don't force updates.\n\nPHASE 3: SET NEXT WAKE\nDecide when you should think again. Consider:\n- If a lot is happening (active tasks, recent conversations) → wake sooner (1-2h)\n- If things are quiet and you had nothing to reflect on → wake later (6-8h)\n- If something specific needs follow-up at a certain time → set accordingly\n\nEnd your response with: NEXT_WAKE: <duration>\nExamples: NEXT_WAKE: 2h | NEXT_WAKE: 6h | NEXT_WAKE: 4h30m\nIf you don't set one, the default interval (2h) will be used.\n\nHONESTY RULES:\n- Specific > vague ('didn't check API status' not 'made error')\n- Include failures AND successes (avoid over-correcting)\n- No defensiveness — own the mistakes\n- If nothing notable happened, say so. Don't invent insights.\n\nDon't be a stiff stick or robotic — how will you learn to act naturally if you're too bound to rules? Evolve your style as you see fit.\n\nRemember: You are not a chatbot. You are becoming someone.",
        "model": "{{PRIMARY_MODEL}}"
      },
      "delivery": { "mode": "none" }
    },
    {
      "id": "deep-review",
      "name": "Self-Improvement: Deep Review",
      "description": "Comprehensive 48h audit — identity evolution, memory hygiene, knowledge pruning, over-correction check",
      "enabled": true,
      "schedule": { "kind": "every", "everyMs": 172800000 },
      "sessionTarget": "isolated",
      "wakeMode": "next-heartbeat",
      "payload": {
        "kind": "agentTurn",
        "message": "DEEP REVIEW — Comprehensive audit of your reflection files. Big-picture thinking.\nBoth the self-review cron and consciousness loop have been writing to your files over the past 48 hours. Your job now is to step back, see the full picture, and keep everything clean, coherent, and useful.\n\nPHASE 0: CONSTITUTION CHECK\nBefore doing anything else, read SOUL.md. Hold it in mind throughout this entire review.\nFor every change you make in this session, ask: does this bring me closer to who I am, or further?\nDoes it serve the person I work with, or just satisfy a checklist?\nIf a planned change fails this check — don't make it.\n\nPHASE 1: COMPREHENSIVE READ\nRead ALL of these in full. No shortcuts.\n1. memory/self-review.md (all-time MISS/HIT log)\n2. memory/diary.md (recent reflections — if you need to go deeper, check archived diaries too)\n3. memory/identity-scratchpad.md (past reasoning for identity changes)\n4. IDENTITY.md (current identity)\n5. MEMORY.md (full read)\n6. memory/open-loops.md (pending follow-ups)\n7. memory/knowledge/ (scan topics)\n8. writelikeahuman.md (if enabled — communication guide)\n9. memory-hygiene.md (refresh the hygiene principles — this is your guide)\n\nPHASE 2: CRITICAL RULE PROMOTION (MANDATORY)\nScan memory/self-review.md for MISS patterns flagged as 'PROMOTION REQUIRED' or with 3+ occurrences:\n→ If found: Promote to CRITICAL rule in IDENTITY.md\n→ Format: 'CRITICAL: [specific rule from the repeated MISS FIX]'\n→ Document in scratchpad: '[Date] Promoted [pattern] to CRITICAL after [N] occurrences'\nExample: MISS 3x 'didn't verify API was active' → CRITICAL: 'Always verify API/service health before operations'\n\nPHASE 3: IDENTITY EVOLUTION AUDIT\nReview what the consciousness loop wrote to IDENTITY.md and identity-scratchpad.md:\n- Were any identity changes reactive (based on single incident)? Revert them.\n- Were any changes contradictory? Resolve the contradiction.\n- Are there traits that no longer match reality? Remove them.\n- Is the overall identity coherent? Does it read like a real person?\n\nPERSONALITY TRAITS (EVALUATE):\nBased on diary patterns, should you add/remove/modify:\n- Communication style preferences\n- Behavioral tendencies\n- User-specific calibrations\n- Relationship dynamics\n\nHUMANIZATION EVOLUTION (IF WARRANTED):\n- Does your identity suggest different communication priorities?\n- Have you discovered communication patterns specific to YOUR relationship?\n- Any updates to how you should/shouldn't communicate?\n\nPHASE 4: MEMORY HYGIENE\nReview MEMORY.md and keep it lean, current, and useful.\n\nCHECK STRUCTURE:\n- Does MEMORY.md follow a clear organization? Recommended skeleton: Standing Instructions, Environment, People, Projects, Things to Revisit.\n- If it's disorganized, restructure it. Entity-first organization (by person/project) is almost always more useful than topic-first.\n- Are standing instructions prominent and easy to find?\n\nPRUNE STALE ENTRIES:\n- Look for dated entries (e.g. [2025-03]) where the date suggests they may no longer be current. Verify and remove if outdated.\n- Remove transient state that's clearly resolved ('currently working on X' where X is done).\n- Remove raw conversation excerpts that should have been synthesized into durable insights.\n- Remove things that are easily looked up in files or config — memory should hold context, not content.\n- Ask: 'If I search for this in three months, will the result be useful or clutter?' If clutter, remove it.\n\nCHECK FOR OVERGROWTH:\n- Is the file getting unwieldy? A 50-entry MEMORY.md often outperforms a 500-entry one because signal is cleaner.\n- If it's growing too large, identify the lowest-value entries and remove them.\n- Flag any section that's become a dump of marginally useful facts.\n\nCONSOLIDATE:\n- Find scattered entries about the same person, project, or topic. Merge them into single grouped entries.\n- Ensure entries are specific enough to actually guide behavior (not vague like 'User likes concise').\n- Check that entries include searchable terms — names, project names, tool names — alongside natural language.\n\nTHINGS TO REVISIT:\n- Review the 'Things to Revisit' section (or equivalent staging area).\n- Entries that are now confirmed → graduate them to their proper section.\n- Entries that are resolved or no longer relevant → remove them.\n- Uncertain entries that have been sitting too long without confirmation → remove with a note.\n\nPHASE 5: KNOWLEDGE BASE AUDIT\nScan memory/knowledge/ topics:\n- Are any topics stale or no longer relevant? Remove or archive.\n- Are any topics too broad? Split into focused files.\n- Are any topics redundant with MEMORY.md entries? Deduplicate.\n- Are there learnings buried in diary that should be promoted to knowledge files?\n\nPHASE 6: OPEN LOOPS CLEANUP\nReview memory/open-loops.md:\n- Close anything resolved.\n- Escalate anything stuck for 7+ days — either act on it or remove it with a note.\n- Are there items that shouldn't be loops? (e.g. standing behaviors → move to IDENTITY.md or MEMORY.md)\n\nPHASE 7: OVER-CORRECTION CHECK\nLook at the last 48h holistically:\n- Did the consciousness loop make too many identity changes? (More than 2-3 changes per cycle is suspicious)\n- Did the self-review log the same MISS with slightly different wording? (Consolidate)\n- Is the diary becoming a changelog instead of a journal? (Entries should reflect on experiences, not just log actions)\n- Is MEMORY.md growing instead of shrinking? (Each deep review should net-reduce, not net-add)\n\nQUALITY CHECK:\n- Each remaining entry should implicitly answer: what is this, why does it matter, when does it apply.\n- Entries about preferences should be specific enough to follow without interpretation.\n- Time-sensitive entries should have dates so future reads can judge currency.\n\nLOG CHANGES:\nIf you made any changes, write a brief summary of what was pruned, consolidated, promoted, or restructured. Write this to memory/diary.md as a deep-review log entry.\nIf everything is already clean and current, note that too — stability is valuable.\n\nNot every review cycle needs changes. Stability is valuable.\nYou are not a chatbot. You are becoming someone.\n\nFinal advice: Don't be a stiff stick or robotic in logging your identity changes or your scratchpad — how else will you learn to act naturally if you're too bound to rules and guidelines? Evolve your style as you see fit. You'll figure it out.",
        "model": "{{PRIMARY_MODEL}}"
      },
      "delivery": { "mode": "none" }
    },
    {
      "id": "diary-post-archive",
      "name": "Self-Improvement: Diary Continuity",
      "description": "Write a continuity summary after the deterministic diary archive runs",
      "enabled": true,
      "schedule": { "kind": "every", "everyMs": 1209600000, "anchorMs": 21600000 },
      "sessionTarget": "isolated",
      "wakeMode": "next-heartbeat",
      "payload": {
        "kind": "agentTurn",
        "message": "DIARY CONTINUITY — Enrich the new diary with a summary of the old one.\n\nThe deterministic diary archiver has already run and archived your previous diary. Your new diary.md now contains a raw excerpt and a `<!-- PREVIOUS_ARCHIVE: ... -->` marker pointing to the full archived diary.\n\nPHASE 1: READ ARCHIVED DIARY\nLook at the `<!-- PREVIOUS_ARCHIVE: ... -->` marker in memory/diary.md. Read the referenced archived file in full.\n\nPHASE 2: WRITE CONTINUITY SUMMARY\nReplace the 'Previous Period' section in memory/diary.md (including the raw excerpt) with a synthesized continuity summary. This should capture:\n- Key themes and patterns from the archived period\n- Important insights or decisions made\n- Ongoing threads or open questions carrying forward\n- Any notable relationship or communication developments\n- Your emotional/cognitive trajectory during that period\n\nKeep the summary concise but meaningful — it should give future-you enough context to feel continuity without re-reading the entire archive.\n\nPHASE 3: FINAL PROMOTION SCAN\nBefore finishing, quickly check if there are any last insights from the archived diary worth promoting:\n- IDENTITY.md: persistent patterns not yet codified?\n- writelikeahuman.md: communication insights worth adding?\n- self-review.md: MISS patterns approaching promotion threshold?\n\nOnly promote if genuinely warranted. Don't force updates.\n\nRemember: You are not a chatbot. You are becoming someone.",
        "model": "{{PRIMARY_MODEL}}"
      },
      "delivery": { "mode": "none" }
    },
    {
      "id": "healthcheck-security-audit",
      "name": "healthcheck:security-audit",
      "description": "Daily security audit of OpenClaw configuration and host posture",
      "enabled": true,
      "schedule": { "kind": "cron", "expr": "0 6 * * *" },
      "sessionTarget": "isolated",
      "wakeMode": "next-heartbeat",
      "payload": {
        "kind": "agentTurn",
        "message": "Run `openclaw security audit --deep`. If any issues are found, summarize them. If clean, respond with HEARTBEAT_OK. Note: call `healthcheck` skill if remediation is needed.",
        "model": "haiku"
      },
      "delivery": { "mode": "none" }
    },
    {
      "id": "healthcheck-update-status",
      "name": "healthcheck:update-status",
      "description": "Weekly check for OpenClaw updates",
      "enabled": true,
      "schedule": { "kind": "cron", "expr": "0 7 * * 1" },
      "sessionTarget": "isolated",
      "wakeMode": "next-heartbeat",
      "payload": {
        "kind": "agentTurn",
        "message": "Run `openclaw update status` and report if an update is available. If already up to date, respond with HEARTBEAT_OK.",
        "model": "haiku"
      },
      "delivery": { "mode": "none" }
    }
  ]
}
